000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.   FRAMEWORK-TEST.
000030 AUTHOR.       SANDY DUNLOP.
000040*Testing .NET COBOL Extensions
000050 
000060 ENVIRONMENT DIVISION.
000070 CONFIGURATION SECTION.
000080 REPOSITORY.
000090        CLASS SYS-STRING AS "System.String"
000100 DATA DIVISION.
000110 WORKING-STORAGE SECTION.
000120 77 NET-STRING    OBJECT REFERENCE SYS-STRING.
000130 77 COB-STRING    PIC X(12).
000140 77 TEXT-OUT      PIC X(12).
000150 
000160 PROCEDURE DIVISION.
000170 MAIN-PARAGRAPH.
000180        MOVE "Hello World!" TO COB-STRING
000190        SET NET-STRING TO COB-STRING
000200        SET TEXT-OUT TO NET-STRING        
000210        DISPLAY TEXT-OUT
000220        STOP RUN.