000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.   FRAMEWORK-TEST.
000030 AUTHOR.       SANDY DUNLOP.
000040*Testing .NET COBOL Extensions
000050 
000060 ENVIRONMENT DIVISION.
000070 CONFIGURATION SECTION.
000075 ATTRIBUTES "TestFixture".
000080 REPOSITORY.
000090        CLASS SYS-STRING AS "System.String"
000095        CLASS SYS-CONSOLE AS "System.Console"
000096        CLASS NUNIT-ASSERT AS "NUnit.Framework.Assert"
000097        CLASS SYS-ENV AS "System.Environment"
000098        CLASS SYS-OS AS "System.OperatingSystem"
000099        CLASS SYS-VER AS "System.Version"
000100 DATA DIVISION.
000110 WORKING-STORAGE SECTION.
000120 77 NET-STRING    OBJECT REFERENCE SYS-STRING.
000130 77 NET-OS        OBJECT REFERENCE SYS-OS.
000131 77 NET-VER        OBJECT REFERENCE SYS-VER.
000135 77 STR-LEN       PIC S(9).
000150 
000160 PROCEDURE DIVISION.
000170 MAIN-PARAGRAPH.
000171        INVOKE SYS-ENV "OSVersion" RETURNING NET-OS
000172        INVOKE NET-OS "Version" RETURNING NET-VER
000173        INVOKE NET-VER "ToString" RETURNING NET-STRING
000175        DISPLAY "OS VERSION IS " NET-STRING
000185        INVOKE NET-STRING "Length"
000186            RETURNING STR-LEN
000187        DISPLAY "Length = " STR-LEN
000200        INVOKE SYS-CONSOLE "WriteLine" 
000202            USING BY VALUE NET-STRING
000210        STOP RUN.
000300 TEST-PARAGRAPH WITH ATTRIBUTES "Test".
000305        MOVE "teststring" TO NET-STRING
000310        INVOKE NUNIT-ASSERT "AreEqual" 
000320            USING BY VALUE "teststring"
000330            USING BY VALUE NET-STRING
000340 END PROGRAM FRAMEWORK-TEST.
