000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.   TESTS.
000030 AUTHOR.       SANDY DUNLOP.
000040*Testing Compiler Functionality
000050 
000060 ENVIRONMENT DIVISION.
000070 CONFIGURATION SECTION.
000075 ATTRIBUTES "TestFixture".
000080 REPOSITORY.
000085        CLASS NUNIT-ASSERT AS "NUnit.Framework.Assert"
000090        CLASS SYS-STRING AS "System.String"
000095        CLASS SYS-CONSOLE AS "System.Console"
000100 DATA DIVISION.
000110 WORKING-STORAGE SECTION.
000120 77 NET-STRING    OBJECT REFERENCE SYS-STRING.
000135 77 STR-LEN       PIC S(9).
000135 77 NUMBER-A      PIC S(9).
000136 77 NUMBER-B      PIC S(9).
000137 77 NUMBER-C      PIC S(9).
000138 77 NUMBER-D      PIC S(9).
000150 
000160 PROCEDURE DIVISION.
000170 MAIN-PARAGRAPH.
000171*Tests run from here for debugging purposes
000172        DISPLAY "Please run these tests from NUnit"
000175        PERFORM MATH-TESTS
000176        PERFORM LOOP-TESTS
000210        STOP RUN.
000215
000220 MATH-TESTS.
000121        PERFORM SIMPLE-ADDITION-A
000122        PERFORM SIMPLE-ADDITION-B
000123        PERFORM SIMPLE-SUBTRACTION-A
000124        PERFORM SIMPLE-SUBTRACTION-B
000125        PERFORM SIMPLE-MULTIPLICATION-A
000126        PERFORM SIMPLE-MULTIPLICATION-B
000127        PERFORM SIMPLE-DIVISION-A
000128        PERFORM SIMPLE-DIVISION-B
000129        PERFORM REMAINDER-DIVISION-A
000130        PERFORM REMAINDER-DIVISION-B
000131
000132 LOOP-TESTS.
000133        PERFORM LOOP-TEST-A
000133        PERFORM LOOP-TEST-B
000134
000300 SIMPLE-DIVISION-A WITH ATTRIBUTES "Test".
000310*Simple division with numbers in variables
000310        MOVE 8 TO NUMBER-A
000320        MOVE 4 TO NUMBER-B
000320        DIVIDE NUMBER-A BY NUMBER-B
000330               GIVING NUMBER-C REMAINDER NUMBER-D
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-C
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 0
000360            USING BY VALUE NUMBER-D
000215
000300 SIMPLE-DIVISION-B WITH ATTRIBUTES "Test".
000310*Simple division with numbers as literals
000320        DIVIDE 8 BY 4
000330               GIVING NUMBER-C REMAINDER NUMBER-D
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-C
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 0
000360            USING BY VALUE NUMBER-D
000369
000300 REMAINDER-DIVISION-A WITH ATTRIBUTES "Test".
000310*Division with remainder and numbers as variables
000310        MOVE 9 TO NUMBER-A
000320        MOVE 4 TO NUMBER-B
000320        DIVIDE NUMBER-A BY NUMBER-B
000330               GIVING NUMBER-C REMAINDER NUMBER-D
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-C
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 1
000360            USING BY VALUE NUMBER-D
000369
000300 REMAINDER-DIVISION-B WITH ATTRIBUTES "Test".
000310*Division with remainder and numbers as literals
000320        DIVIDE 9 BY 4
000330               GIVING NUMBER-C REMAINDER NUMBER-D
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-C
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 1
000360            USING BY VALUE NUMBER-D
000369
000400 LOOP-TEST-A WITH ATTRIBUTES "Test".
000405        MOVE 0 TO NUMBER-B
000410        PERFORM VARYING NUMBER-A FROM 1 by 1 UNTIL NUMBER-A = 11
000405            ADD 1 TO NUMBER-B GIVING NUMBER-B
000406            INVOKE NUNIT-ASSERT "Less" 
000407                USING BY VALUE NUMBER-A
000408                USING BY VALUE 11
000406            INVOKE NUNIT-ASSERT "Greater" 
000407                USING BY VALUE NUMBER-A
000408                USING BY VALUE ZERO
000420        END-PERFORM
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 10
000360            USING BY VALUE NUMBER-B
000215
000400 LOOP-TEST-B WITH ATTRIBUTES "Test".
000405        MOVE 11 TO NUMBER-B
000410        PERFORM VARYING NUMBER-A FROM 10 by -1 UNTIL NUMBER-A = 0
000405            SUBTRACT 1 FROM NUMBER-B GIVING NUMBER-B
000406            INVOKE NUNIT-ASSERT "Less" 
000407                USING BY VALUE NUMBER-A
000408                USING BY VALUE 11
000406            INVOKE NUNIT-ASSERT "Greater" 
000407                USING BY VALUE NUMBER-A
000408                USING BY VALUE ZERO
000420        END-PERFORM
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 1
000360            USING BY VALUE NUMBER-B
000215
000300 SIMPLE-ADDITION-A WITH ATTRIBUTES "Test".
000310*Simple addition with numbers in variables
000310        MOVE 8 TO NUMBER-A
000320        MOVE 4 TO NUMBER-B
000320        ADD NUMBER-A TO NUMBER-B
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 12
000360            USING BY VALUE NUMBER-B
000370       
000300 SIMPLE-ADDITION-B WITH ATTRIBUTES "Test".
000310*Simple addition with numbers in variables
000320        ADD 8 TO 4 GIVING NUMBER-B
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 12
000360            USING BY VALUE NUMBER-B
000370       
000300 SIMPLE-SUBTRACTION-A WITH ATTRIBUTES "Test".
000310*Simple subtraction with numbers in variables
000310        MOVE 8 TO NUMBER-A
000320        MOVE 4 TO NUMBER-B
000320        SUBTRACT NUMBER-B FROM NUMBER-A
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 4
000360            USING BY VALUE NUMBER-A
000370       
000300 SIMPLE-SUBTRACTION-B WITH ATTRIBUTES "Test".
000310*Simple subtraction with numbers in variables
000320        SUBTRACT 4 FROM 8 GIVING NUMBER-B
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 4
000360            USING BY VALUE NUMBER-B
000370       
000300 SIMPLE-MULTIPLICATION-A WITH ATTRIBUTES "Test".
000310*Simple multiplication with numbers as variables
000310        MOVE 2 TO NUMBER-A
000320        MOVE 4 TO NUMBER-B
000320        MULTIPLY NUMBER-A BY NUMBER-B
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 8
000360            USING BY VALUE NUMBER-A
000369
000300 SIMPLE-MULTIPLICATION-B WITH ATTRIBUTES "Test".
000310*Simple multiplication with numbers as literals
000320        MULTIPLY 4 BY 2
000330               GIVING NUMBER-A
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 8
000360            USING BY VALUE NUMBER-A
000369
000001 IF-TEST-A WITH ATTRIBUTES "Test".
000001        MOVE 2 TO NUMBER-A
000001        MOVE 0 TO NUMBER-B
000180        IF NUMBER-A = 2 AND NUMBER-A > 1 THEN
000190            MOVE 1 TO NUMBER-B
000200        ELSE
000190            MOVE 2 TO NUMBER-B
000220        END-IF
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 1
000360            USING BY VALUE NUMBER-B
003060        
000001 IF-TEST-B WITH ATTRIBUTES "Test".
000001        MOVE 2 TO NUMBER-A
000001        MOVE 0 TO NUMBER-B
000180        IF NUMBER-A = 2 AND NUMBER-A < 3 THEN
000190            MOVE 1 TO NUMBER-B
000200        ELSE
000190            MOVE 2 TO NUMBER-B
000220        END-IF
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 1
000360            USING BY VALUE NUMBER-B
003060        
000001 IF-TEST-C WITH ATTRIBUTES "Test".
000001        MOVE 2 TO NUMBER-A
000001        MOVE 0 TO NUMBER-B
000180        IF NUMBER-A = 2 AND NUMBER-A < 2 THEN
000190            MOVE 1 TO NUMBER-B
000200        ELSE
000190            MOVE 2 TO NUMBER-B
000220        END-IF
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-B
003060        
000001 IF-TEST-D WITH ATTRIBUTES "Test".
000001        MOVE 2 TO NUMBER-A
000001        MOVE 0 TO NUMBER-B
000180        IF NUMBER-A = 1 AND NUMBER-A = 2 THEN
000190            MOVE 1 TO NUMBER-B
000200        ELSE
000190            MOVE 2 TO NUMBER-B
000220        END-IF
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-B
003060        
000001 IF-TEST-E WITH ATTRIBUTES "Test".
000001        MOVE 2 TO NUMBER-A
000001        MOVE 0 TO NUMBER-B
000180        IF NUMBER-A = 1 OR NUMBER-A = 2 THEN
000190            MOVE 1 TO NUMBER-B
000200        ELSE
000190            MOVE 2 TO NUMBER-B
000220        END-IF
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 1
000360            USING BY VALUE NUMBER-B
003060        
000001 IF-TEST-F WITH ATTRIBUTES "Test".
000001        MOVE 2 TO NUMBER-A
000001        MOVE 0 TO NUMBER-B
000180        IF NUMBER-A = 1 OR NUMBER-A = 3 THEN
000190            MOVE 1 TO NUMBER-B
000200        ELSE
000190            MOVE 2 TO NUMBER-B
000220        END-IF
000340        INVOKE NUNIT-ASSERT "AreEqual" 
000350            USING BY VALUE 2
000360            USING BY VALUE NUMBER-B
003060        
003070 END PROGRAM TESTS.
